app/Controllers/Artikel.php

    public function admin_index()
{
    $title = 'Daftar Artikel (Admin)';
    $model = new \App\Models\ArtikelModel();

    $q = $this->request->getVar('q') ?? '';
    $kategori_id = $this->request->getVar('kategori_id') ?? '';
    $page = $this->request->getVar('page') ?? 1;

    $builder = $model->table('artikel')
        ->select('artikel.*, kategori.nama_kategori')
        ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

    if ($q != '') {
        $builder->like('artikel.judul', $q);
    }

    if ($kategori_id != '') {
        $builder->where('artikel.id_kategori', $kategori_id);
    }

    $artikel = $builder->paginate(10, 'default', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%Artikel Pertama%' ESCAPE '!'
AND `artikel`.`id_kategori` = '1'
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%Artikel Pertama%' ESCAPE '!'
AND `artikel`.`id_kategori` = '1'
 LIMIT 10

        return $this->response->setJSON($data);
    } else {
        $kategoriModel = new \App\Models\KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`


        return view('artikel/form_add', [
            'title' => 'Tambah Artikel',
            'kategori' => $kategoriModel->findAll()
---
SELECT *
FROM `kategori`


        return view('artikel/form_edit', [
            'title' => 'Edit Artikel',
            'artikel' => $model->find($id),
            'kategori' => $kategoriModel->findAll()
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '7'
SELECT *
FROM `kategori`

    public function delete($id)
    {
        $model = new ArtikelModel();
        $model->delete($id);
---
DELETE FROM `artikel`
WHERE `id` IN ('6')